airfoild2D/iteration1_custom_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        physicalType    inlet;
        nFaces          134;
        startFace       21254;
    }
    outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          160;
        startFace       21388;
    }
    walls
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          78;
        startFace       21548;
    }
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1(empty);
        nFaces          21440;
        startFace       21626;
    }
)

// ************************************************************************* //
